BitNibble/Source_Library/stm32f411lib/src/stm32fxxxtim2to5.c
/******************************************************************************
	STM32 XXX TIM 2 to 5
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-XXX
Date: 22062023
Comment:
	
*******************************************************************************/
/*** File Library ***/
#include "stm32fxxxtim2to5.h"

/*** File Variables ***/
static STM32FXXXTIM2_CR1 stm32fxxx_tim2_cr1;
static STM32FXXXTIM2_CR2 stm32fxxx_tim2_cr2;
static STM32FXXXTIM2_SMCR stm32fxxx_tim2_smcr;
static STM32FXXXTIM2_DIER stm32fxxx_tim2_dier;
static STM32FXXXTIM2_SR stm32fxxx_tim2_sr;
static STM32FXXXTIM2_EGR stm32fxxx_tim2_egr;
static STM32FXXXTIM2_CCMR1 stm32fxxx_tim2_ccmr1;
static STM32FXXXTIM2_CCMR2 stm32fxxx_tim2_ccmr2;
static STM32FXXXTIM2_CCER stm32fxxx_tim2_ccer;
static STM32FXXXTIM2_DCR stm32fxxx_tim2_dcr;
static STM32FXXXTIM2obj stm32fxxx_tim2;
static STM32FXXXTIM3_CR1 stm32fxxx_tim3_cr1;
static STM32FXXXTIM3_CR2 stm32fxxx_tim3_cr2;
static STM32FXXXTIM3_SMCR stm32fxxx_tim3_smcr;
static STM32FXXXTIM3_DIER stm32fxxx_tim3_dier;
static STM32FXXXTIM3_SR stm32fxxx_tim3_sr;
static STM32FXXXTIM3_EGR stm32fxxx_tim3_egr;
static STM32FXXXTIM3_CCMR1 stm32fxxx_tim3_ccmr1;
static STM32FXXXTIM3_CCMR2 stm32fxxx_tim3_ccmr2;
static STM32FXXXTIM3_CCER stm32fxxx_tim3_ccer;
static STM32FXXXTIM3_DCR stm32fxxx_tim3_dcr;
static STM32FXXXTIM3obj stm32fxxx_tim3;
static STM32FXXXTIM4_CR1 stm32fxxx_tim4_cr1;
static STM32FXXXTIM4_CR2 stm32fxxx_tim4_cr2;
static STM32FXXXTIM4_SMCR stm32fxxx_tim4_smcr;
static STM32FXXXTIM4_DIER stm32fxxx_tim4_dier;
static STM32FXXXTIM4_SR stm32fxxx_tim4_sr;
static STM32FXXXTIM4_EGR stm32fxxx_tim4_egr;
static STM32FXXXTIM4_CCMR1 stm32fxxx_tim4_ccmr1;
static STM32FXXXTIM4_CCMR2 stm32fxxx_tim4_ccmr2;
static STM32FXXXTIM4_CCER stm32fxxx_tim4_ccer;
static STM32FXXXTIM4_DCR stm32fxxx_tim4_dcr;
static STM32FXXXTIM4obj stm32fxxx_tim4;
static STM32FXXXTIM5_CR1 stm32fxxx_tim5_cr1;
static STM32FXXXTIM5_CR2 stm32fxxx_tim5_cr2;
static STM32FXXXTIM5_SMCR stm32fxxx_tim5_smcr;
static STM32FXXXTIM5_DIER stm32fxxx_tim5_dier;
static STM32FXXXTIM5_SR stm32fxxx_tim5_sr;
static STM32FXXXTIM5_EGR stm32fxxx_tim5_egr;
static STM32FXXXTIM5_CCMR1 stm32fxxx_tim5_ccmr1;
static STM32FXXXTIM5_CCMR2 stm32fxxx_tim5_ccmr2;
static STM32FXXXTIM5_CCER stm32fxxx_tim5_ccer;
static STM32FXXXTIM5_DCR stm32fxxx_tim5_dcr;
static STM32FXXXTIM5obj stm32fxxx_tim5;

/*** File Procedure & Function Header ***/
/*** Auxiliar 2 to 5 ***/
STM32FXXXTIM2_CR1* stm32fxxx_tim2_cr1_inic(void);
STM32FXXXTIM2_CR2* stm32fxxx_tim2_cr2_inic(void);
STM32FXXXTIM2_SMCR* stm32fxxx_tim2_smcr_inic(void);
STM32FXXXTIM2_DIER* stm32fxxx_tim2_dier_inic(void);
STM32FXXXTIM2_SR* stm32fxxx_tim2_sr_inic(void);
STM32FXXXTIM2_EGR* stm32fxxx_tim2_egr_inic(void);
STM32FXXXTIM2_CCMR1* stm32fxxx_tim2_ccmr1_inic(void);
STM32FXXXTIM2_CCMR2* stm32fxxx_tim2_ccmr2_inic(void);
STM32FXXXTIM2_CCER* stm32fxxx_tim2_ccer_inic(void);
STM32FXXXTIM2_DCR* stm32fxxx_tim2_dcr_inic(void);
STM32FXXXTIM3_CR1* stm32fxxx_tim3_cr1_inic(void);
STM32FXXXTIM3_CR2* stm32fxxx_tim3_cr2_inic(void);
STM32FXXXTIM3_SMCR* stm32fxxx_tim3_smcr_inic(void);
STM32FXXXTIM3_DIER* stm32fxxx_tim3_dier_inic(void);
STM32FXXXTIM3_SR* stm32fxxx_tim3_sr_inic(void);
STM32FXXXTIM3_EGR* stm32fxxx_tim3_egr_inic(void);
STM32FXXXTIM3_CCMR1* stm32fxxx_tim3_ccmr1_inic(void);
STM32FXXXTIM3_CCMR2* stm32fxxx_tim3_ccmr2_inic(void);
STM32FXXXTIM3_CCER* stm32fxxx_tim3_ccer_inic(void);
STM32FXXXTIM3_DCR* stm32fxxx_tim3_dcr_inic(void);
STM32FXXXTIM4_CR1* stm32fxxx_tim4_cr1_inic(void);
STM32FXXXTIM4_CR2* stm32fxxx_tim4_cr2_inic(void);
STM32FXXXTIM4_SMCR* stm32fxxx_tim4_smcr_inic(void);
STM32FXXXTIM4_DIER* stm32fxxx_tim4_dier_inic(void);
STM32FXXXTIM4_SR* stm32fxxx_tim4_sr_inic(void);
STM32FXXXTIM4_EGR* stm32fxxx_tim4_egr_inic(void);
STM32FXXXTIM4_CCMR1* stm32fxxx_tim4_ccmr1_inic(void);
STM32FXXXTIM4_CCMR2* stm32fxxx_tim4_ccmr2_inic(void);
STM32FXXXTIM4_CCER* stm32fxxx_tim4_ccer_inic(void);
STM32FXXXTIM4_DCR* stm32fxxx_tim4_dcr_inic(void);
STM32FXXXTIM5_CR1* stm32fxxx_tim5_cr1_inic(void);
STM32FXXXTIM5_CR2* stm32fxxx_tim5_cr2_inic(void);
STM32FXXXTIM5_SMCR* stm32fxxx_tim5_smcr_inic(void);
STM32FXXXTIM5_DIER* stm32fxxx_tim5_dier_inic(void);
STM32FXXXTIM5_SR* stm32fxxx_tim5_sr_inic(void);
STM32FXXXTIM5_EGR* stm32fxxx_tim5_egr_inic(void);
STM32FXXXTIM5_CCMR1* stm32fxxx_tim5_ccmr1_inic(void);
STM32FXXXTIM5_CCMR2* stm32fxxx_tim5_ccmr2_inic(void);
STM32FXXXTIM5_CCER* stm32fxxx_tim5_ccer_inic(void);
STM32FXXXTIM5_DCR* stm32fxxx_tim5_dcr_inic(void);
/*** TIMER Procedure & Function Definition ***/
/************/
/*** TIM2 ***/
/************/
void STM32FXXXTim2Clock(uint8_t bool)
{
	if(bool){RCC->APB1ENR |= (1 << 0);}else{RCC->APB1ENR &= ~(1 << 0);}
}
void STM32FXXXTim2Nvic(uint8_t bool)
{ // 28
	if(bool){setbit(NVIC->ISER, 1, TIM2_IRQn, 1);} else{setbit(NVIC->ICER, 1, TIM2_IRQn, 1);}
}
/************************/
/*** TIM2 Bit Mapping ***/
/************************/
// CR1
void STM32FXXXTim2_ckd(uint8_t value)
{
	setreg(&TIM2->CR1, 2, 8, value);
}
uint8_t STM32FXXXTim2_get_ckd(void)
{
	return readreg(TIM2->CR1, 2, 8);
}
void STM32FXXXTim2_set_apre(uint8_t bool)
{
	setreg(&TIM2->CR1, 1, 7, bool);
}
void STM32FXXXTim2_set_cms(uint8_t value)
{
	setreg(&TIM2->CR1, 2, 5, value);
}
void STM32FXXXTim2_set_dir(uint8_t bool)
{
	setreg(&TIM2->CR1, 1, 4, bool);
}
void STM32FXXXTim2_set_opm(uint8_t bool)
{
	setreg(&TIM2->CR1, 1, 3, bool);
}
void STM32FXXXTim2_set_urs(uint8_t bool)
{
	setreg(&TIM2->CR1, 1, 2, bool);
}
void STM32FXXXTim2_set_udis(uint8_t bool)
{
	setreg(&TIM2->CR1, 1, 1, bool);
}
void STM32FXXXTim2_cen(uint8_t bool)
{
	setreg(&TIM2->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXTim2_ti1s(uint8_t bool)
{
	setreg(&TIM2->CR2, 1, 7, bool);
}
void STM32FXXXTim2_mms(uint8_t value)
{
	setreg(&TIM2->CR2, 3, 4, value);
}
void STM32FXXXTim2_ccds(uint8_t bool)
{
	setreg(&TIM2->CR2, 1, 3, bool);
}
// SMCR
void STM32FXXXTim2_etp(uint8_t bool)
{
	setreg(&TIM2->SMCR, 1, 15, bool);
}
void STM32FXXXTim2_ece(uint8_t bool)
{
	setreg(&TIM2->SMCR, 1, 14, bool);
}
void STM32FXXXTim2_etps(uint8_t value)
{
	setreg(&TIM2->SMCR, 2, 12, value);
}
void STM32FXXXTim2_etf(uint8_t value)
{
	setreg(&TIM2->SMCR, 4, 8, value);
}
void STM32FXXXTim2_msm(uint8_t bool)
{
	setreg(&TIM2->SMCR, 1, 7, bool);
}
void STM32FXXXTim2_ts(uint8_t value)
{
	setreg(&TIM2->SMCR, 3, 4, value);
}
void STM32FXXXTim2_sms(uint8_t value)
{
	setreg(&TIM2->SMCR, 3, 0, value);
}
// DIER
void STM32FXXXTim2_tde(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 14, bool);
}
void STM32FXXXTim2_cc4de(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 12, bool);
}
void STM32FXXXTim2_cc3de(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 11, bool);
}
void STM32FXXXTim2_cc2de(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 10, bool);
}
void STM32FXXXTim2_cc1de(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 9, bool);
}
void STM32FXXXTim2_ude(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 8, bool);
}
void STM32FXXXTim2_tie(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 6, bool);
}
void STM32FXXXTim2_cc4ie(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 4, bool);
}
void STM32FXXXTim2_cc3ie(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 3, bool);
}
void STM32FXXXTim2_cc2ie(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 2, bool);
}
void STM32FXXXTim2_cc1ie(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 1, bool);
}
void STM32FXXXTim2_uie(uint8_t bool)
{
	setreg(&TIM2->DIER, 1, 0, bool);
}
// SR
uint8_t STM32FXXXTim2_cc4of(void)
{
	return readreg(TIM2->SR, 1, 12);
}
void STM32FXXXTim2_clear_cc4of(void)
{
	setreg(&TIM2->SR, 1, 12, 0);
}
uint8_t STM32FXXXTim2_cc3of(void)
{
	return readreg(TIM2->SR, 1, 11);
}
void STM32FXXXTim2_clear_cc3of(void)
{
	setreg(&TIM2->SR, 1, 11, 0);
}
uint8_t STM32FXXXTim2_cc2of(void)
{
	return readreg(TIM2->SR, 1, 10);
}
void STM32FXXXTim2_clear_cc2of(void)
{
	setreg(&TIM2->SR, 1, 10, 0);
}
uint8_t STM32FXXXTim2_cc1of(void)
{
	return readreg(TIM2->SR, 1, 9);
}
void STM32FXXXTim2_clear_cc1of(void)
{
	setreg(&TIM2->SR, 1, 9, 0);
}
uint8_t STM32FXXXTim2_tif(void)
{
	return readreg(TIM2->SR, 1, 6);
}
void STM32FXXXTim2_clear_tif(void)
{
	setreg(&TIM2->SR, 1, 6, 0);
}
uint8_t STM32FXXXTim2_cc4if(void)
{
	return readreg(TIM2->SR, 1, 4);
}
void STM32FXXXTim2_clear_cc4if(void)
{
	setreg(&TIM2->SR, 1, 4, 0);
}
uint8_t STM32FXXXTim2_cc3if(void)
{
	return readreg(TIM2->SR, 1, 3);
}
void STM32FXXXTim2_clear_cc3if(void)
{
	setreg(&TIM2->SR, 1, 3, 0);
}
uint8_t STM32FXXXTim2_cc2if(void)
{
	return readreg(TIM2->SR, 1, 2);
}
void STM32FXXXTim2_clear_cc2if(void)
{
	setreg(&TIM2->SR, 1, 2, 0);
}
uint8_t STM32FXXXTim2_cc1if(void)
{
	return readreg(TIM2->SR, 1, 1);
}
void STM32FXXXTim2_clear_cc1if(void)
{
	setreg(&TIM2->SR, 1, 1, 0);
}
uint8_t STM32FXXXTim2_uif(void)
{
	return readreg(TIM2->SR, 1, 0);
}
void STM32FXXXTim2_clear_uif(void)
{
	setreg(&TIM2->SR, 1, 0, 0);
}
// EGR
void STM32FXXXTim2_tg(void)
{
	setreg(&TIM2->EGR, 1, 6, 1);
}
void STM32FXXXTim2_cc4g(void)
{
	setreg(&TIM2->EGR, 1, 4, 1);
}
void STM32FXXXTim2_cc3g(void)
{
	setreg(&TIM2->EGR, 1, 3, 1);
}
void STM32FXXXTim2_cc2g(void)
{
	setreg(&TIM2->EGR, 1, 2, 1);
}
void STM32FXXXTim2_cc1g(void)
{
	setreg(&TIM2->EGR, 1, 1, 1);
}
void STM32FXXXTim2_ug(void)
{
	setreg(&TIM2->EGR, 1, 0, 1);
}
// CCMR1
void STM32FXXXTim2_oc2ce(uint8_t value)
{
	setreg(&TIM2->CCMR1, 1, 15, value);
}
void STM32FXXXTim2_oc2m(uint8_t value)
{
	setreg(&TIM2->CCMR1, 3, 12, value);
}
void STM32FXXXTim2_ic2f(uint8_t value)
{
	setreg(&TIM2->CCMR1, 4, 12, value);
}
void STM32FXXXTim2_oc2pe(uint8_t bool)
{
	setreg(&TIM2->CCMR1, 1, 11, bool);
}
void STM32FXXXTim2_oc2fe(uint8_t bool)
{
	setreg(&TIM2->CCMR1, 1, 10, bool);
}
void STM32FXXXTim2_ic2psc(uint8_t value)
{
	setreg(&TIM2->CCMR1, 2, 10, value);
}
void STM32FXXXTim2_cc2s(uint8_t value)
{
	setreg(&TIM2->CCMR1, 2, 8, value);
}
void STM32FXXXTim2_oc1ce(uint8_t value)
{
	setreg(&TIM2->CCMR1, 1, 7, value);
}
void STM32FXXXTim2_oc1m(uint8_t value)
{
	setreg(&TIM2->CCMR1, 3, 4, value);
}
void STM32FXXXTim2_ic1f(uint8_t value)
{
	setreg(&TIM2->CCMR1, 4, 4, value);
}
void STM32FXXXTim2_oc1pe(uint8_t bool)
{
	setreg(&TIM2->CCMR1, 1, 3, bool);
}
void STM32FXXXTim2_oc1fe(uint8_t bool)
{
	setreg(&TIM2->CCMR1, 1, 2, bool);
}
void STM32FXXXTim2_ic1psc(uint8_t value)
{
	setreg(&TIM2->CCMR1, 2, 2, value);
}
void STM32FXXXTim2_cc1s(uint8_t value)
{
	setreg(&TIM2->CCMR1, 2, 0, value);
}
// CCMR2
void STM32FXXXTim2_oc4ce(uint8_t value)
{
	setreg(&TIM2->CCMR2, 1, 15, value);
}
void STM32FXXXTim2_oc4m(uint8_t value)
{
	setreg(&TIM2->CCMR2, 3, 12, value);
}
void STM32FXXXTim2_ic4f(uint8_t value)
{
	setreg(&TIM2->CCMR2, 4, 12, value);
}
void STM32FXXXTim2_oc4pe(uint8_t bool)
{
	setreg(&TIM2->CCMR2, 1, 11, bool);
}
void STM32FXXXTim2_oc4fe(uint8_t bool)
{
	setreg(&TIM2->CCMR2, 1, 10, bool);
}
void STM32FXXXTim2_ic4psc(uint8_t value)
{
	setreg(&TIM2->CCMR2, 2, 10, value);
}
void STM32FXXXTim2_cc4s(uint8_t value)
{
	setreg(&TIM2->CCMR2, 2, 8, value);
}
void STM32FXXXTim2_oc3ce(uint8_t value)
{
	setreg(&TIM2->CCMR2, 1, 7, value);
}
void STM32FXXXTim2_oc3m(uint8_t value)
{
	setreg(&TIM2->CCMR2, 3, 4, value);
}
void STM32FXXXTim2_ic3f(uint8_t value)
{
	setreg(&TIM2->CCMR2, 4, 4, value);
}
void STM32FXXXTim2_oc3pe(uint8_t bool)
{
	setreg(&TIM2->CCMR2, 1, 3, bool);
}
void STM32FXXXTim2_oc3fe(uint8_t bool)
{
	setreg(&TIM2->CCMR2, 1, 2, bool);
}
void STM32FXXXTim2_ic3psc(uint8_t value)
{
	setreg(&TIM2->CCMR2, 2, 2, value);
}
void STM32FXXXTim2_cc3s(uint8_t value)
{
	setreg(&TIM2->CCMR2, 2, 0, value);
}
// CCER
void STM32FXXXTim2_cc4np(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 15, bool);
}
void STM32FXXXTim2_cc4p(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 13, bool);
}
void STM32FXXXTim2_cc4e(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 12, bool);
}
void STM32FXXXTim2_cc3np(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 11, bool);
}
void STM32FXXXTim2_cc3p(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 9, bool);
}
void STM32FXXXTim2_cc3e(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 8, bool);
}
void STM32FXXXTim2_cc2np(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 7, bool);
}
void STM32FXXXTim2_cc2p(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 5, bool);
}
void STM32FXXXTim2_cc2e(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 4, bool);
}
void STM32FXXXTim2_cc1np(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 3, bool);
}
void STM32FXXXTim2_cc1p(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 1, bool);
}
void STM32FXXXTim2_cc1e(uint8_t bool)
{
	setreg(&TIM2->CCER, 1, 0, bool);
}
// CNT
void STM32FXXXTim2_cnt(uint32_t value)
{
	TIM2->CNT = value;
}
uint32_t STM32FXXXTim2_get_cnt(void)
{
	return TIM2->CNT;
}
// PSC
void STM32FXXXTim2_psc(uint16_t value)
{
	TIM2->PSC = value;
}
// ARR
void STM32FXXXTim2_arr(uint32_t value)
{
	TIM2->ARR = value;
}
// CCR1
void STM32FXXXTim2_ccr1(uint32_t value)
{
	TIM2->CCR1 = value;
}
// CCR2
void STM32FXXXTim2_ccr2(uint32_t value)
{
	TIM2->CCR2 = value;
}
// CCR3
void STM32FXXXTim2_ccr3(uint32_t value)
{
	TIM2->CCR3 = value;
}
// CCR4
void STM32FXXXTim2_ccr4(uint32_t value)
{
	TIM2->CCR4 = value;
}
// DCR
void STM32FXXXTim2_dbl(uint8_t value)
{
	setreg(&TIM2->DCR, 5, 8, value);
}
void STM32FXXXTim2_dba(uint8_t value)
{
	setreg(&TIM2->DCR, 5, 0, value);
}
// DMAR
void STM32FXXXTim2_dmab(uint16_t value)
{
	TIM2->DMAR = value;
}
uint16_t STM32FXXXTim2_get_dmab(void)
{
	return TIM2->DMAR;
}
// OR
void STM32FXXXTim2_itr1_rmp(uint8_t value)
{
	setreg(&TIM2->OR, 2, 10, value);
}
/************/
/*** TIM3 ***/
/************/
void STM32FXXXTim3Clock(uint8_t bool)
{
	if(bool){RCC->APB1ENR |= (1 << 1);}else{RCC->APB1ENR &= ~(1 << 1);}
}
void STM32FXXXTim3Nvic(uint8_t bool)
{ // 29
	if(bool){setbit(NVIC->ISER, 1, TIM3_IRQn, 1);} else{setbit(NVIC->ICER, 1, TIM3_IRQn, 1);}
}
/************************/
/*** TIM3 Bit Mapping ***/
/************************/
// CR1
void STM32FXXXTim3_ckd(uint8_t value)
{
	setreg(&TIM2->CR1, 2, 8, value);
}
uint8_t STM32FXXXTim3_get_ckd(void)
{
	return readreg(TIM3->CR1, 2, 8);
}
void STM32FXXXTim3_set_apre(uint8_t bool)
{
	setreg(&TIM3->CR1, 1, 7, bool);
}
void STM32FXXXTim3_set_cms(uint8_t value)
{
	setreg(&TIM3->CR1, 2, 5, value);
}
void STM32FXXXTim3_set_dir(uint8_t bool)
{
	setreg(&TIM3->CR1, 1, 4, bool);
}
void STM32FXXXTim3_set_opm(uint8_t bool)
{
	setreg(&TIM3->CR1, 1, 3, bool);
}
void STM32FXXXTim3_set_urs(uint8_t bool)
{
	setreg(&TIM3->CR1, 1, 2, bool);
}
void STM32FXXXTim3_set_udis(uint8_t bool)
{
	setreg(&TIM3->CR1, 1, 1, bool);
}
void STM32FXXXTim3_cen(uint8_t bool)
{
	setreg(&TIM3->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXTim3_ti1s(uint8_t bool)
{
	setreg(&TIM3->CR2, 1, 7, bool);
}
void STM32FXXXTim3_mms(uint8_t value)
{
	setreg(&TIM3->CR2, 3, 4, value);
}
void STM32FXXXTim3_ccds(uint8_t bool)
{
	setreg(&TIM3->CR2, 1, 3, bool);
}
// SMCR
void STM32FXXXTim3_etp(uint8_t bool)
{
	setreg(&TIM3->SMCR, 1, 15, bool);
}
void STM32FXXXTim3_ece(uint8_t bool)
{
	setreg(&TIM3->SMCR, 1, 14, bool);
}
void STM32FXXXTim3_etps(uint8_t value)
{
	setreg(&TIM3->SMCR, 2, 12, value);
}
void STM32FXXXTim3_etf(uint8_t value)
{
	setreg(&TIM3->SMCR, 4, 8, value);
}
void STM32FXXXTim3_msm(uint8_t bool)
{
	setreg(&TIM3->SMCR, 1, 7, bool);
}
void STM32FXXXTim3_ts(uint8_t value)
{
	setreg(&TIM3->SMCR, 3, 4, value);
}
void STM32FXXXTim3_sms(uint8_t value)
{
	setreg(&TIM3->SMCR, 3, 0, value);
}
// DIER
void STM32FXXXTim3_tde(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 14, bool);
}
void STM32FXXXTim3_cc4de(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 12, bool);
}
void STM32FXXXTim3_cc3de(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 11, bool);
}
void STM32FXXXTim3_cc2de(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 10, bool);
}
void STM32FXXXTim3_cc1de(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 9, bool);
}
void STM32FXXXTim3_ude(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 8, bool);
}
void STM32FXXXTim3_tie(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 6, bool);
}
void STM32FXXXTim3_cc4ie(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 4, bool);
}
void STM32FXXXTim3_cc3ie(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 3, bool);
}
void STM32FXXXTim3_cc2ie(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 2, bool);
}
void STM32FXXXTim3_cc1ie(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 1, bool);
}
void STM32FXXXTim3_uie(uint8_t bool)
{
	setreg(&TIM3->DIER, 1, 0, bool);
}
// SR
uint8_t STM32FXXXTim3_cc4of(void)
{
	return readreg(TIM3->SR, 1, 12);
}
void STM32FXXXTim3_clear_cc4of(void)
{
	setreg(&TIM3->SR, 1, 12, 0);
}
uint8_t STM32FXXXTim3_cc3of(void)
{
	return readreg(TIM3->SR, 1, 11);
}
void STM32FXXXTim3_clear_cc3of(void)
{
	setreg(&TIM3->SR, 1, 11, 0);
}
uint8_t STM32FXXXTim3_cc2of(void)
{
	return readreg(TIM3->SR, 1, 10);
}
void STM32FXXXTim3_clear_cc2of(void)
{
	setreg(&TIM3->SR, 1, 10, 0);
}
uint8_t STM32FXXXTim3_cc1of(void)
{
	return readreg(TIM3->SR, 1, 9);
}
void STM32FXXXTim3_clear_cc1of(void)
{
	setreg(&TIM3->SR, 1, 9, 0);
}
uint8_t STM32FXXXTim3_tif(void)
{
	return readreg(TIM3->SR, 1, 6);
}
void STM32FXXXTim3_clear_tif(void)
{
	setreg(&TIM3->SR, 1, 6, 0);
}
uint8_t STM32FXXXTim3_cc4if(void)
{
	return readreg(TIM3->SR, 1, 4);
}
void STM32FXXXTim3_clear_cc4if(void)
{
	setreg(&TIM3->SR, 1, 4, 0);
}
uint8_t STM32FXXXTim3_cc3if(void)
{
	return readreg(TIM3->SR, 1, 3);
}
void STM32FXXXTim3_clear_cc3if(void)
{
	setreg(&TIM3->SR, 1, 3, 0);
}
uint8_t STM32FXXXTim3_cc2if(void)
{
	return readreg(TIM3->SR, 1, 2);
}
void STM32FXXXTim3_clear_cc2if(void)
{
	setreg(&TIM3->SR, 1, 2, 0);
}
uint8_t STM32FXXXTim3_cc1if(void)
{
	return readreg(TIM3->SR, 1, 1);
}
void STM32FXXXTim3_clear_cc1if(void)
{
	setreg(&TIM3->SR, 1, 1, 0);
}
uint8_t STM32FXXXTim3_uif(void)
{
	return readreg(TIM3->SR, 1, 0);
}
void STM32FXXXTim3_clear_uif(void)
{
	setreg(&TIM3->SR, 1, 0, 0);
}
// EGR
void STM32FXXXTim3_tg(void)
{
	setreg(&TIM3->EGR, 1, 6, 1);
}
void STM32FXXXTim3_cc4g(void)
{
	setreg(&TIM3->EGR, 1, 4, 1);
}
void STM32FXXXTim3_cc3g(void)
{
	setreg(&TIM3->EGR, 1, 3, 1);
}
void STM32FXXXTim3_cc2g(void)
{
	setreg(&TIM3->EGR, 1, 2, 1);
}
void STM32FXXXTim3_cc1g(void)
{
	setreg(&TIM3->EGR, 1, 1, 1);
}
void STM32FXXXTim3_ug(void)
{
	setreg(&TIM3->EGR, 1, 0, 1);
}
// CCMR1
void STM32FXXXTim3_oc2ce(uint8_t value)
{
	setreg(&TIM3->CCMR1, 1, 15, value);
}
void STM32FXXXTim3_oc2m(uint8_t value)
{
	setreg(&TIM3->CCMR1, 3, 12, value);
}
void STM32FXXXTim3_ic2f(uint8_t value)
{
	setreg(&TIM3->CCMR1, 4, 12, value);
}
void STM32FXXXTim3_oc2pe(uint8_t bool)
{
	setreg(&TIM3->CCMR1, 1, 11, bool);
}
void STM32FXXXTim3_oc2fe(uint8_t bool)
{
	setreg(&TIM3->CCMR1, 1, 10, bool);
}
void STM32FXXXTim3_ic2psc(uint8_t value)
{
	setreg(&TIM3->CCMR1, 2, 10, value);
}
void STM32FXXXTim3_cc2s(uint8_t value)
{
	setreg(&TIM3->CCMR1, 2, 8, value);
}
void STM32FXXXTim3_oc1ce(uint8_t value)
{
	setreg(&TIM3->CCMR1, 1, 7, value);
}
void STM32FXXXTim3_oc1m(uint8_t value)
{
	setreg(&TIM3->CCMR1, 3, 4, value);
}
void STM32FXXXTim3_ic1f(uint8_t value)
{
	setreg(&TIM3->CCMR1, 4, 4, value);
}
void STM32FXXXTim3_oc1pe(uint8_t bool)
{
	setreg(&TIM3->CCMR1, 1, 3, bool);
}
void STM32FXXXTim3_oc1fe(uint8_t bool)
{
	setreg(&TIM3->CCMR1, 1, 2, bool);
}
void STM32FXXXTim3_ic1psc(uint8_t value)
{
	setreg(&TIM3->CCMR1, 2, 2, value);
}
void STM32FXXXTim3_cc1s(uint8_t value)
{
	setreg(&TIM3->CCMR1, 2, 0, value);
}
// CCMR2
void STM32FXXXTim3_oc4ce(uint8_t value)
{
	setreg(&TIM3->CCMR2, 1, 15, value);
}
void STM32FXXXTim3_oc4m(uint8_t value)
{
	setreg(&TIM3->CCMR2, 3, 12, value);
}
void STM32FXXXTim3_ic4f(uint8_t value)
{
	setreg(&TIM3->CCMR2, 4, 12, value);
}
void STM32FXXXTim3_oc4pe(uint8_t bool)
{
	setreg(&TIM3->CCMR2, 1, 11, bool);
}
void STM32FXXXTim3_oc4fe(uint8_t bool)
{
	setreg(&TIM3->CCMR2, 1, 10, bool);
}
void STM32FXXXTim3_ic4psc(uint8_t value)
{
	setreg(&TIM3->CCMR2, 2, 10, value);
}
void STM32FXXXTim3_cc4s(uint8_t value)
{
	setreg(&TIM3->CCMR2, 2, 8, value);
}
void STM32FXXXTim3_oc3ce(uint8_t value)
{
	setreg(&TIM3->CCMR2, 1, 7, value);
}
void STM32FXXXTim3_oc3m(uint8_t value)
{
	setreg(&TIM3->CCMR2, 3, 4, value);
}
void STM32FXXXTim3_ic3f(uint8_t value)
{
	setreg(&TIM3->CCMR2, 4, 4, value);
}
void STM32FXXXTim3_oc3pe(uint8_t bool)
{
	setreg(&TIM3->CCMR2, 1, 3, bool);
}
void STM32FXXXTim3_oc3fe(uint8_t bool)
{
	setreg(&TIM3->CCMR2, 1, 2, bool);
}
void STM32FXXXTim3_ic3psc(uint8_t value)
{
	setreg(&TIM3->CCMR2, 2, 2, value);
}
void STM32FXXXTim3_cc3s(uint8_t value)
{
	setreg(&TIM3->CCMR2, 2, 0, value);
}
// CCER
void STM32FXXXTim3_cc4np(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 15, bool);
}
void STM32FXXXTim3_cc4p(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 13, bool);
}
void STM32FXXXTim3_cc4e(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 12, bool);
}
void STM32FXXXTim3_cc3np(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 11, bool);
}
void STM32FXXXTim3_cc3p(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 9, bool);
}
void STM32FXXXTim3_cc3e(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 8, bool);
}
void STM32FXXXTim3_cc2np(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 7, bool);
}
void STM32FXXXTim3_cc2p(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 5, bool);
}
void STM32FXXXTim3_cc2e(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 4, bool);
}
void STM32FXXXTim3_cc1np(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 3, bool);
}
void STM32FXXXTim3_cc1p(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 1, bool);
}
void STM32FXXXTim3_cc1e(uint8_t bool)
{
	setreg(&TIM3->CCER, 1, 0, bool);
}
// CNT
void STM32FXXXTim3_cnt(uint16_t value)
{
	TIM3->CNT = value;
}
uint16_t STM32FXXXTim3_get_cnt(void)
{
	return TIM3->CNT;
}
// PSC
void STM32FXXXTim3_psc(uint16_t value)
{
	TIM3->PSC = value;
}
// ARR
void STM32FXXXTim3_arr(uint16_t value)
{
	TIM3->ARR = value;
}
// CCR1
void STM32FXXXTim3_ccr1(uint16_t value)
{
	TIM3->CCR1 = value;
}
// CCR2
void STM32FXXXTim3_ccr2(uint16_t value)
{
	TIM3->CCR2 = value;
}
// CCR3
void STM32FXXXTim3_ccr3(uint16_t value)
{
	TIM3->CCR3 = value;
}
// CCR4
void STM32FXXXTim3_ccr4(uint16_t value)
{
	TIM3->CCR4 = value;
}
// DCR
void STM32FXXXTim3_dbl(uint8_t value)
{
	setreg(&TIM3->DCR, 5, 8, value);
}
void STM32FXXXTim3_dba(uint8_t value)
{
	setreg(&TIM3->DCR, 5, 0, value);
}
// DMAR
void STM32FXXXTim3_dmab(uint16_t value)
{
	TIM3->DMAR = value;
}
uint16_t STM32FXXXTim3_get_dmab(void)
{
	return TIM3->DMAR;
}
/************/
/*** TIM4 ***/
/************/
void STM32FXXXTim4Clock(uint8_t bool)
{
	if(bool){RCC->APB1ENR |= (1 << 2);}else{RCC->APB1ENR &= ~(1 << 2);}
}
void STM32FXXXTim4Nvic(uint8_t bool)
{ // 30
	if(bool){setbit(NVIC->ISER, 1, TIM4_IRQn, 1);} else{setbit(NVIC->ICER, 1, TIM4_IRQn, 1);}
}
/************************/
/*** TIM4 Bit Mapping ***/
/************************/
// CR1
void STM32FXXXTim4_ckd(uint8_t value)
{
	setreg(&TIM2->CR1, 2, 8, value);
}
uint8_t STM32FXXXTim4_get_ckd(void)
{
	return readreg(TIM4->CR1, 2, 8);
}
void STM32FXXXTim4_set_apre(uint8_t bool)
{
	setreg(&TIM4->CR1, 1, 7, bool);
}
void STM32FXXXTim4_set_cms(uint8_t value)
{
	setreg(&TIM4->CR1, 2, 5, value);
}
void STM32FXXXTim4_set_dir(uint8_t bool)
{
	setreg(&TIM4->CR1, 1, 4, bool);
}
void STM32FXXXTim4_set_opm(uint8_t bool)
{
	setreg(&TIM4->CR1, 1, 3, bool);
}
void STM32FXXXTim4_set_urs(uint8_t bool)
{
	setreg(&TIM4->CR1, 1, 2, bool);
}
void STM32FXXXTim4_set_udis(uint8_t bool)
{
	setreg(&TIM4->CR1, 1, 1, bool);
}
void STM32FXXXTim4_cen(uint8_t bool)
{
	setreg(&TIM4->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXTim4_ti1s(uint8_t bool)
{
	setreg(&TIM4->CR2, 1, 7, bool);
}
void STM32FXXXTim4_mms(uint8_t value)
{
	setreg(&TIM4->CR2, 3, 4, value);
}
void STM32FXXXTim4_ccds(uint8_t bool)
{
	setreg(&TIM4->CR2, 1, 3, bool);
}
// SMCR
void STM32FXXXTim4_etp(uint8_t bool)
{
	setreg(&TIM4->SMCR, 1, 15, bool);
}
void STM32FXXXTim4_ece(uint8_t bool)
{
	setreg(&TIM4->SMCR, 1, 14, bool);
}
void STM32FXXXTim4_etps(uint8_t value)
{
	setreg(&TIM4->SMCR, 2, 12, value);
}
void STM32FXXXTim4_etf(uint8_t value)
{
	setreg(&TIM4->SMCR, 4, 8, value);
}
void STM32FXXXTim4_msm(uint8_t bool)
{
	setreg(&TIM4->SMCR, 1, 7, bool);
}
void STM32FXXXTim4_ts(uint8_t value)
{
	setreg(&TIM4->SMCR, 3, 4, value);
}
void STM32FXXXTim4_sms(uint8_t value)
{
	setreg(&TIM4->SMCR, 3, 0, value);
}
// DIER
void STM32FXXXTim4_tde(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 14, bool);
}
void STM32FXXXTim4_cc4de(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 12, bool);
}
void STM32FXXXTim4_cc3de(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 11, bool);
}
