BitNibble/Source_Library/stm32f411lib/src/stm32fxxxtim2to5.c
void STM32FXXXTim4_cc2de(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 10, bool);
}
void STM32FXXXTim4_cc1de(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 9, bool);
}
void STM32FXXXTim4_ude(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 8, bool);
}
void STM32FXXXTim4_tie(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 6, bool);
}
void STM32FXXXTim4_cc4ie(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 4, bool);
}
void STM32FXXXTim4_cc3ie(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 3, bool);
}
void STM32FXXXTim4_cc2ie(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 2, bool);
}
void STM32FXXXTim4_cc1ie(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 1, bool);
}
void STM32FXXXTim4_uie(uint8_t bool)
{
	setreg(&TIM4->DIER, 1, 0, bool);
}
// SR
uint8_t STM32FXXXTim4_cc4of(void)
{
	return readreg(TIM4->SR, 1, 12);
}
void STM32FXXXTim4_clear_cc4of(void)
{
	setreg(&TIM4->SR, 1, 12, 0);
}
uint8_t STM32FXXXTim4_cc3of(void)
{
	return readreg(TIM4->SR, 1, 11);
}
void STM32FXXXTim4_clear_cc3of(void)
{
	setreg(&TIM4->SR, 1, 11, 0);
}
uint8_t STM32FXXXTim4_cc2of(void)
{
	return readreg(TIM4->SR, 1, 10);
}
void STM32FXXXTim4_clear_cc2of(void)
{
	setreg(&TIM4->SR, 1, 10, 0);
}
uint8_t STM32FXXXTim4_cc1of(void)
{
	return readreg(TIM4->SR, 1, 9);
}
void STM32FXXXTim4_clear_cc1of(void)
{
	setreg(&TIM4->SR, 1, 9, 0);
}
uint8_t STM32FXXXTim4_tif(void)
{
	return readreg(TIM4->SR, 1, 6);
}
void STM32FXXXTim4_clear_tif(void)
{
	setreg(&TIM4->SR, 1, 6, 0);
}
uint8_t STM32FXXXTim4_cc4if(void)
{
	return readreg(TIM4->SR, 1, 4);
}
void STM32FXXXTim4_clear_cc4if(void)
{
	setreg(&TIM4->SR, 1, 4, 0);
}
uint8_t STM32FXXXTim4_cc3if(void)
{
	return readreg(TIM4->SR, 1, 3);
}
void STM32FXXXTim4_clear_cc3if(void)
{
	setreg(&TIM4->SR, 1, 3, 0);
}
uint8_t STM32FXXXTim4_cc2if(void)
{
	return readreg(TIM4->SR, 1, 2);
}
void STM32FXXXTim4_clear_cc2if(void)
{
	setreg(&TIM4->SR, 1, 2, 0);
}
uint8_t STM32FXXXTim4_cc1if(void)
{
	return readreg(TIM4->SR, 1, 1);
}
void STM32FXXXTim4_clear_cc1if(void)
{
	setreg(&TIM4->SR, 1, 1, 0);
}
uint8_t STM32FXXXTim4_uif(void)
{
	return readreg(TIM4->SR, 1, 0);
}
void STM32FXXXTim4_clear_uif(void)
{
	setreg(&TIM4->SR, 1, 0, 0);
}
// EGR
void STM32FXXXTim4_tg(void)
{
	setreg(&TIM4->EGR, 1, 6, 1);
}
void STM32FXXXTim4_cc4g(void)
{
	setreg(&TIM4->EGR, 1, 4, 1);
}
void STM32FXXXTim4_cc3g(void)
{
	setreg(&TIM4->EGR, 1, 3, 1);
}
void STM32FXXXTim4_cc2g(void)
{
	setreg(&TIM4->EGR, 1, 2, 1);
}
void STM32FXXXTim4_cc1g(void)
{
	setreg(&TIM4->EGR, 1, 1, 1);
}
void STM32FXXXTim4_ug(void)
{
	setreg(&TIM4->EGR, 1, 0, 1);
}
// CCMR1
void STM32FXXXTim4_oc2ce(uint8_t value)
{
	setreg(&TIM4->CCMR1, 1, 15, value);
}
void STM32FXXXTim4_oc2m(uint8_t value)
{
	setreg(&TIM4->CCMR1, 3, 12, value);
}
void STM32FXXXTim4_ic2f(uint8_t value)
{
	setreg(&TIM4->CCMR1, 4, 12, value);
}
void STM32FXXXTim4_oc2pe(uint8_t bool)
{
	setreg(&TIM4->CCMR1, 1, 11, bool);
}
void STM32FXXXTim4_oc2fe(uint8_t bool)
{
	setreg(&TIM4->CCMR1, 1, 10, bool);
}
void STM32FXXXTim4_ic2psc(uint8_t value)
{
	setreg(&TIM4->CCMR1, 2, 10, value);
}
void STM32FXXXTim4_cc2s(uint8_t value)
{
	setreg(&TIM4->CCMR1, 2, 8, value);
}
void STM32FXXXTim4_oc1ce(uint8_t value)
{
	setreg(&TIM4->CCMR1, 1, 7, value);
}
void STM32FXXXTim4_oc1m(uint8_t value)
{
	setreg(&TIM4->CCMR1, 3, 4, value);
}
void STM32FXXXTim4_ic1f(uint8_t value)
{
	setreg(&TIM4->CCMR1, 4, 4, value);
}
void STM32FXXXTim4_oc1pe(uint8_t bool)
{
	setreg(&TIM4->CCMR1, 1, 3, bool);
}
void STM32FXXXTim4_oc1fe(uint8_t bool)
{
	setreg(&TIM4->CCMR1, 1, 2, bool);
}
void STM32FXXXTim4_ic1psc(uint8_t value)
{
	setreg(&TIM4->CCMR1, 2, 2, value);
}
void STM32FXXXTim4_cc1s(uint8_t value)
{
	setreg(&TIM4->CCMR1, 2, 0, value);
}
// CCMR2
void STM32FXXXTim4_oc4ce(uint8_t value)
{
	setreg(&TIM4->CCMR2, 1, 15, value);
}
void STM32FXXXTim4_oc4m(uint8_t value)
{
	setreg(&TIM4->CCMR2, 3, 12, value);
}
void STM32FXXXTim4_ic4f(uint8_t value)
{
	setreg(&TIM4->CCMR2, 4, 12, value);
}
void STM32FXXXTim4_oc4pe(uint8_t bool)
{
	setreg(&TIM4->CCMR2, 1, 11, bool);
}
void STM32FXXXTim4_oc4fe(uint8_t bool)
{
	setreg(&TIM4->CCMR2, 1, 10, bool);
}
void STM32FXXXTim4_ic4psc(uint8_t value)
{
	setreg(&TIM4->CCMR2, 2, 10, value);
}
void STM32FXXXTim4_cc4s(uint8_t value)
{
	setreg(&TIM4->CCMR2, 2, 8, value);
}
void STM32FXXXTim4_oc3ce(uint8_t value)
{
	setreg(&TIM4->CCMR2, 1, 7, value);
}
void STM32FXXXTim4_oc3m(uint8_t value)
{
	setreg(&TIM4->CCMR2, 3, 4, value);
}
void STM32FXXXTim4_ic3f(uint8_t value)
{
	setreg(&TIM4->CCMR2, 4, 4, value);
}
void STM32FXXXTim4_oc3pe(uint8_t bool)
{
	setreg(&TIM4->CCMR2, 1, 3, bool);
}
void STM32FXXXTim4_oc3fe(uint8_t bool)
{
	setreg(&TIM4->CCMR2, 1, 2, bool);
}
void STM32FXXXTim4_ic3psc(uint8_t value)
{
	setreg(&TIM4->CCMR2, 2, 2, value);
}
void STM32FXXXTim4_cc3s(uint8_t value)
{
	setreg(&TIM4->CCMR2, 2, 0, value);
}
// CCER
void STM32FXXXTim4_cc4np(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 15, bool);
}
void STM32FXXXTim4_cc4p(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 13, bool);
}
void STM32FXXXTim4_cc4e(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 12, bool);
}
void STM32FXXXTim4_cc3np(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 11, bool);
}
void STM32FXXXTim4_cc3p(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 9, bool);
}
void STM32FXXXTim4_cc3e(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 8, bool);
}
void STM32FXXXTim4_cc2np(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 7, bool);
}
void STM32FXXXTim4_cc2p(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 5, bool);
}
void STM32FXXXTim4_cc2e(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 4, bool);
}
void STM32FXXXTim4_cc1np(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 3, bool);
}
void STM32FXXXTim4_cc1p(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 1, bool);
}
void STM32FXXXTim4_cc1e(uint8_t bool)
{
	setreg(&TIM4->CCER, 1, 0, bool);
}
// CNT
void STM32FXXXTim4_cnt(uint16_t value)
{
	TIM4->CNT = value;
}
uint16_t STM32FXXXTim4_get_cnt(void)
{
	return TIM4->CNT;
}
// PSC
void STM32FXXXTim4_psc(uint16_t value)
{
	TIM4->PSC = value;
}
// ARR
void STM32FXXXTim4_arr(uint16_t value)
{
	TIM4->ARR = value;
}
// CCR1
void STM32FXXXTim4_ccr1(uint16_t value)
{
	TIM4->CCR1 = value;
}
// CCR2
void STM32FXXXTim4_ccr2(uint16_t value)
{
	TIM4->CCR2 = value;
}
// CCR3
void STM32FXXXTim4_ccr3(uint16_t value)
{
	TIM4->CCR3 = value;
}
// CCR4
void STM32FXXXTim4_ccr4(uint16_t value)
{
	TIM4->CCR4 = value;
}
// DCR
void STM32FXXXTim4_dbl(uint8_t value)
{
	setreg(&TIM4->DCR, 5, 8, value);
}
void STM32FXXXTim4_dba(uint8_t value)
{
	setreg(&TIM4->DCR, 5, 0, value);
}
// DMAR
void STM32FXXXTim4_dmab(uint16_t value)
{
	TIM4->DMAR = value;
}
uint16_t STM32FXXXTim4_get_dmab(void)
{
	return TIM4->DMAR;
}
/************/
/*** TIM5 ***/
/************/
void STM32FXXXTim5Clock(uint8_t bool)
{
	if(bool){RCC->APB1ENR |= (1 << 3);}else{RCC->APB1ENR &= ~(1 << 3);}
}
void STM32FXXXTim5Nvic(uint8_t bool)
{ // 50
	if(bool){setbit(NVIC->ISER, 1, TIM5_IRQn, 1);} else{setbit(NVIC->ICER, 1, TIM5_IRQn, 1);}
}
/************************/
/*** TIM5 Bit Mapping ***/
/************************/
// CR1
void STM32FXXXTim5_ckd(uint8_t value)
{
	setreg(&TIM2->CR1, 2, 8, value);
}
uint8_t STM32FXXXTim5_get_ckd(void)
{
	return readreg(TIM5->CR1, 2, 8);
}
void STM32FXXXTim5_set_apre(uint8_t bool)
{
	setreg(&TIM5->CR1, 1, 7, bool);
}
void STM32FXXXTim5_set_cms(uint8_t value)
{
	setreg(&TIM5->CR1, 2, 5, value);
}
void STM32FXXXTim5_set_dir(uint8_t bool)
{
	setreg(&TIM5->CR1, 1, 4, bool);
}
void STM32FXXXTim5_set_opm(uint8_t bool)
{
	setreg(&TIM5->CR1, 1, 3, bool);
}
void STM32FXXXTim5_set_urs(uint8_t bool)
{
	setreg(&TIM5->CR1, 1, 2, bool);
}
void STM32FXXXTim5_set_udis(uint8_t bool)
{
	setreg(&TIM5->CR1, 1, 1, bool);
}
void STM32FXXXTim5_cen(uint8_t bool)
{
	setreg(&TIM5->CR1, 1, 0, bool);
}
// CR2
void STM32FXXXTim5_ti1s(uint8_t bool)
{
	setreg(&TIM5->CR2, 1, 7, bool);
}
void STM32FXXXTim5_mms(uint8_t value)
{
	setreg(&TIM5->CR2, 3, 4, value);
}
void STM32FXXXTim5_ccds(uint8_t bool)
{
	setreg(&TIM5->CR2, 1, 3, bool);
}
// SMCR
void STM32FXXXTim5_etp(uint8_t bool)
{
	setreg(&TIM5->SMCR, 1, 15, bool);
}
void STM32FXXXTim5_ece(uint8_t bool)
{
	setreg(&TIM5->SMCR, 1, 14, bool);
}
void STM32FXXXTim5_etps(uint8_t value)
{
	setreg(&TIM5->SMCR, 2, 12, value);
}
void STM32FXXXTim5_etf(uint8_t value)
{
	setreg(&TIM5->SMCR, 4, 8, value);
}
void STM32FXXXTim5_msm(uint8_t bool)
{
	setreg(&TIM5->SMCR, 1, 7, bool);
}
void STM32FXXXTim5_ts(uint8_t value)
{
	setreg(&TIM5->SMCR, 3, 4, value);
}
void STM32FXXXTim5_sms(uint8_t value)
{
	setreg(&TIM5->SMCR, 3, 0, value);
}
// DIER
void STM32FXXXTim5_tde(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 14, bool);
}
void STM32FXXXTim5_cc4de(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 12, bool);
}
void STM32FXXXTim5_cc3de(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 11, bool);
}
void STM32FXXXTim5_cc2de(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 10, bool);
}
void STM32FXXXTim5_cc1de(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 9, bool);
}
void STM32FXXXTim5_ude(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 8, bool);
}
void STM32FXXXTim5_tie(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 6, bool);
}
void STM32FXXXTim5_cc4ie(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 4, bool);
}
void STM32FXXXTim5_cc3ie(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 3, bool);
}
void STM32FXXXTim5_cc2ie(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 2, bool);
}
void STM32FXXXTim5_cc1ie(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 1, bool);
}
void STM32FXXXTim5_uie(uint8_t bool)
{
	setreg(&TIM5->DIER, 1, 0, bool);
}
// SR
uint8_t STM32FXXXTim5_cc4of(void)
{
	return readreg(TIM5->SR, 1, 12);
}
void STM32FXXXTim5_clear_cc4of(void)
{
	setreg(&TIM5->SR, 1, 12, 0);
}
uint8_t STM32FXXXTim5_cc3of(void)
{
	return readreg(TIM5->SR, 1, 11);
}
void STM32FXXXTim5_clear_cc3of(void)
{
	setreg(&TIM5->SR, 1, 11, 0);
}
uint8_t STM32FXXXTim5_cc2of(void)
{
	return readreg(TIM5->SR, 1, 10);
}
void STM32FXXXTim5_clear_cc2of(void)
{
	setreg(&TIM5->SR, 1, 10, 0);
}
uint8_t STM32FXXXTim5_cc1of(void)
{
	return readreg(TIM5->SR, 1, 9);
}
void STM32FXXXTim5_clear_cc1of(void)
{
	setreg(&TIM5->SR, 1, 9, 0);
}
uint8_t STM32FXXXTim5_tif(void)
{
	return readreg(TIM5->SR, 1, 6);
}
void STM32FXXXTim5_clear_tif(void)
{
	setreg(&TIM5->SR, 1, 6, 0);
}
uint8_t STM32FXXXTim5_cc4if(void)
{
	return readreg(TIM5->SR, 1, 4);
}
void STM32FXXXTim5_clear_cc4if(void)
{
	setreg(&TIM5->SR, 1, 4, 0);
}
uint8_t STM32FXXXTim5_cc3if(void)
{
	return readreg(TIM5->SR, 1, 3);
}
void STM32FXXXTim5_clear_cc3if(void)
{
	setreg(&TIM5->SR, 1, 3, 0);
}
uint8_t STM32FXXXTim5_cc2if(void)
{
	return readreg(TIM5->SR, 1, 2);
}
void STM32FXXXTim5_clear_cc2if(void)
{
	setreg(&TIM5->SR, 1, 2, 0);
}
uint8_t STM32FXXXTim5_cc1if(void)
{
	return readreg(TIM5->SR, 1, 1);
}
void STM32FXXXTim5_clear_cc1if(void)
{
	setreg(&TIM5->SR, 1, 1, 0);
}
uint8_t STM32FXXXTim5_uif(void)
{
	return readreg(TIM5->SR, 1, 0);
}
void STM32FXXXTim5_clear_uif(void)
{
	setreg(&TIM5->SR, 1, 0, 0);
}
// EGR
void STM32FXXXTim5_tg(void)
{
	setreg(&TIM5->EGR, 1, 6, 1);
}
void STM32FXXXTim5_cc4g(void)
{
	setreg(&TIM5->EGR, 1, 4, 1);
}
void STM32FXXXTim5_cc3g(void)
{
	setreg(&TIM5->EGR, 1, 3, 1);
}
void STM32FXXXTim5_cc2g(void)
{
	setreg(&TIM5->EGR, 1, 2, 1);
}
void STM32FXXXTim5_cc1g(void)
{
	setreg(&TIM5->EGR, 1, 1, 1);
}
void STM32FXXXTim5_ug(void)
{
	setreg(&TIM5->EGR, 1, 0, 1);
}
// CCMR1
void STM32FXXXTim5_oc2ce(uint8_t value)
{
	setreg(&TIM5->CCMR1, 1, 15, value);
}
void STM32FXXXTim5_oc2m(uint8_t value)
{
	setreg(&TIM5->CCMR1, 3, 12, value);
}
void STM32FXXXTim5_ic2f(uint8_t value)
{
	setreg(&TIM5->CCMR1, 4, 12, value);
}
void STM32FXXXTim5_oc2pe(uint8_t bool)
{
	setreg(&TIM5->CCMR1, 1, 11, bool);
}
void STM32FXXXTim5_oc2fe(uint8_t bool)
{
	setreg(&TIM5->CCMR1, 1, 10, bool);
}
void STM32FXXXTim5_ic2psc(uint8_t value)
{
	setreg(&TIM5->CCMR1, 2, 10, value);
}
void STM32FXXXTim5_cc2s(uint8_t value)
{
	setreg(&TIM5->CCMR1, 2, 8, value);
}
void STM32FXXXTim5_oc1ce(uint8_t value)
{
	setreg(&TIM5->CCMR1, 1, 7, value);
}
void STM32FXXXTim5_oc1m(uint8_t value)
{
	setreg(&TIM5->CCMR1, 3, 4, value);
}
void STM32FXXXTim5_ic1f(uint8_t value)
{
	setreg(&TIM5->CCMR1, 4, 4, value);
}
void STM32FXXXTim5_oc1pe(uint8_t bool)
{
	setreg(&TIM5->CCMR1, 1, 3, bool);
}
void STM32FXXXTim5_oc1fe(uint8_t bool)
{
	setreg(&TIM5->CCMR1, 1, 2, bool);
}
void STM32FXXXTim5_ic1psc(uint8_t value)
{
	setreg(&TIM5->CCMR1, 2, 2, value);
}
void STM32FXXXTim5_cc1s(uint8_t value)
{
	setreg(&TIM5->CCMR1, 2, 0, value);
}
// CCMR2
void STM32FXXXTim5_oc4ce(uint8_t value)
{
	setreg(&TIM5->CCMR2, 1, 15, value);
}
void STM32FXXXTim5_oc4m(uint8_t value)
{
	setreg(&TIM5->CCMR2, 3, 12, value);
}
void STM32FXXXTim5_ic4f(uint8_t value)
{
	setreg(&TIM5->CCMR2, 4, 12, value);
}
void STM32FXXXTim5_oc4pe(uint8_t bool)
{
	setreg(&TIM5->CCMR2, 1, 11, bool);
}
void STM32FXXXTim5_oc4fe(uint8_t bool)
{
	setreg(&TIM5->CCMR2, 1, 10, bool);
}
void STM32FXXXTim5_ic4psc(uint8_t value)
{
	setreg(&TIM5->CCMR2, 2, 10, value);
}
void STM32FXXXTim5_cc4s(uint8_t value)
{
	setreg(&TIM5->CCMR2, 2, 8, value);
}
void STM32FXXXTim5_oc3ce(uint8_t value)
{
	setreg(&TIM5->CCMR2, 1, 7, value);
}
void STM32FXXXTim5_oc3m(uint8_t value)
{
	setreg(&TIM5->CCMR2, 3, 4, value);
}
void STM32FXXXTim5_ic3f(uint8_t value)
{
	setreg(&TIM5->CCMR2, 4, 4, value);
}
void STM32FXXXTim5_oc3pe(uint8_t bool)
{
	setreg(&TIM5->CCMR2, 1, 3, bool);
}
void STM32FXXXTim5_oc3fe(uint8_t bool)
{
	setreg(&TIM5->CCMR2, 1, 2, bool);
}
void STM32FXXXTim5_ic3psc(uint8_t value)
{
	setreg(&TIM5->CCMR2, 2, 2, value);
}
void STM32FXXXTim5_cc3s(uint8_t value)
{
	setreg(&TIM5->CCMR2, 2, 0, value);
}
// CCER
void STM32FXXXTim5_cc4np(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 15, bool);
}
void STM32FXXXTim5_cc4p(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 13, bool);
}
void STM32FXXXTim5_cc4e(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 12, bool);
}
void STM32FXXXTim5_cc3np(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 11, bool);
}
void STM32FXXXTim5_cc3p(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 9, bool);
}
void STM32FXXXTim5_cc3e(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 8, bool);
}
void STM32FXXXTim5_cc2np(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 7, bool);
}
void STM32FXXXTim5_cc2p(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 5, bool);
}
void STM32FXXXTim5_cc2e(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 4, bool);
}
void STM32FXXXTim5_cc1np(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 3, bool);
}
void STM32FXXXTim5_cc1p(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 1, bool);
}
void STM32FXXXTim5_cc1e(uint8_t bool)
{
	setreg(&TIM5->CCER, 1, 0, bool);
}
// CNT
void STM32FXXXTim5_cnt(uint32_t value)
{
	TIM5->CNT = value;
}
uint32_t STM32FXXXTim5_get_cnt(void)
{
	return TIM5->CNT;
}
// PSC
void STM32FXXXTim5_psc(uint16_t value)
{
	TIM5->PSC = value;
}
// ARR
void STM32FXXXTim5_arr(uint32_t value)
{
	TIM5->ARR = value;
}
// CCR1
void STM32FXXXTim5_ccr1(uint32_t value)
{
	TIM5->CCR1 = value;
}
// CCR2
void STM32FXXXTim5_ccr2(uint32_t value)
{
	TIM5->CCR2 = value;
}
// CCR3
void STM32FXXXTim5_ccr3(uint32_t value)
{
	TIM5->CCR3 = value;
}
// CCR4
void STM32FXXXTim5_ccr4(uint32_t value)
{
	TIM5->CCR4 = value;
}
// DCR
void STM32FXXXTim5_dbl(uint8_t value)
{
	setreg(&TIM5->DCR, 5, 8, value);
}
void STM32FXXXTim5_dba(uint8_t value)
{
	setreg(&TIM5->DCR, 5, 0, value);
}
// DMAR
void STM32FXXXTim5_dmab(uint16_t value)
{
	TIM5->DMAR = value;
}
uint16_t STM32FXXXTim5_get_dmab(void)
{
	return TIM5->DMAR;
}
// OR
void STM32FXXXTim5_ti4_rmp(uint8_t value)
{
	setreg(&TIM5->OR, 2, 6, value);
}
/*** TIM2 Auxiliar ***/
STM32FXXXTIM2_CR1* stm32fxxx_tim2_cr1_inic(void)
{

	// CR1
	stm32fxxx_tim2_cr1.get_ckd = STM32FXXXTim2_get_ckd;
	stm32fxxx_tim2_cr1.apre = STM32FXXXTim2_set_apre;
	stm32fxxx_tim2_cr1.cms = STM32FXXXTim2_set_cms;
	stm32fxxx_tim2_cr1.dir = STM32FXXXTim2_set_dir;
	stm32fxxx_tim2_cr1.opm = STM32FXXXTim2_set_opm;
	stm32fxxx_tim2_cr1.urs = STM32FXXXTim2_set_urs;
	stm32fxxx_tim2_cr1.udis = STM32FXXXTim2_set_udis;
	stm32fxxx_tim2_cr1.cen = STM32FXXXTim2_cen;
	return &stm32fxxx_tim2_cr1;
}
STM32FXXXTIM2_CR2* stm32fxxx_tim2_cr2_inic(void)
{

