BitNibble/Source_Library/stm32f411lib/src/stm32fxxxtim2to5.c
	// CR2
	stm32fxxx_tim4_cr2.ti1s = STM32FXXXTim4_ti1s;
	stm32fxxx_tim4_cr2.mms = STM32FXXXTim4_mms;
	stm32fxxx_tim4_cr2.ccds = STM32FXXXTim4_ccds;
	return &stm32fxxx_tim4_cr2;
}
STM32FXXXTIM4_SMCR* stm32fxxx_tim4_smcr_inic(void)
{

	// SMCR
	stm32fxxx_tim4_smcr.etp = STM32FXXXTim4_etp;
	stm32fxxx_tim4_smcr.ece = STM32FXXXTim4_ece;
	stm32fxxx_tim4_smcr.etps = STM32FXXXTim4_etps;
	stm32fxxx_tim4_smcr.etf = STM32FXXXTim4_etf;
	stm32fxxx_tim4_smcr.msm = STM32FXXXTim4_msm;
	stm32fxxx_tim4_smcr.ts = STM32FXXXTim4_ts;
	stm32fxxx_tim4_smcr.sms = STM32FXXXTim4_sms;
	return &stm32fxxx_tim4_smcr;
}
STM32FXXXTIM4_DIER* stm32fxxx_tim4_dier_inic(void)
{

	// DIER
	stm32fxxx_tim4_dier.tde = STM32FXXXTim4_tde;
	stm32fxxx_tim4_dier.cc4de = STM32FXXXTim4_cc4de;
	stm32fxxx_tim4_dier.cc3de = STM32FXXXTim4_cc3de;
	stm32fxxx_tim4_dier.cc2de = STM32FXXXTim4_cc2de;
	stm32fxxx_tim4_dier.cc1de = STM32FXXXTim4_cc1de;
	stm32fxxx_tim4_dier.ude = STM32FXXXTim4_ude;
	stm32fxxx_tim4_dier.tie = STM32FXXXTim4_tie;
	stm32fxxx_tim4_dier.cc4ie = STM32FXXXTim4_cc4ie;
	stm32fxxx_tim4_dier.cc3ie = STM32FXXXTim4_cc3ie;
	stm32fxxx_tim4_dier.cc2ie = STM32FXXXTim4_cc2ie;
	stm32fxxx_tim4_dier.cc1ie = STM32FXXXTim4_cc1ie;
	stm32fxxx_tim4_dier.uie = STM32FXXXTim4_uie;
	return &stm32fxxx_tim4_dier;
}
STM32FXXXTIM4_SR* stm32fxxx_tim4_sr_inic(void)
{

	// SR
	stm32fxxx_tim4_sr.cc4of = STM32FXXXTim4_cc4of;
	stm32fxxx_tim4_sr.clear_cc4of = STM32FXXXTim4_clear_cc4of;
	stm32fxxx_tim4_sr.cc3of = STM32FXXXTim4_cc3of;
	stm32fxxx_tim4_sr.clear_cc3of = STM32FXXXTim4_clear_cc3of;
	stm32fxxx_tim4_sr.cc2of = STM32FXXXTim4_cc2of;
	stm32fxxx_tim4_sr.clear_cc2of = STM32FXXXTim4_clear_cc2of;
	stm32fxxx_tim4_sr.cc1of = STM32FXXXTim4_cc1of;
	stm32fxxx_tim4_sr.clear_cc1of = STM32FXXXTim4_clear_cc1of;
	stm32fxxx_tim4_sr.tif = STM32FXXXTim4_tif;
	stm32fxxx_tim4_sr.clear_tif = STM32FXXXTim4_clear_tif;
	stm32fxxx_tim4_sr.cc4if = STM32FXXXTim4_cc4if;
	stm32fxxx_tim4_sr.clear_cc4if = STM32FXXXTim4_clear_cc4if;
	stm32fxxx_tim4_sr.cc3if = STM32FXXXTim4_cc3if;
	stm32fxxx_tim4_sr.clear_cc3if = STM32FXXXTim4_clear_cc3if;
	stm32fxxx_tim4_sr.cc2if = STM32FXXXTim4_cc2if;
	stm32fxxx_tim4_sr.clear_cc2if = STM32FXXXTim4_clear_cc2if;
	stm32fxxx_tim4_sr.cc1if = STM32FXXXTim4_cc1if;
	stm32fxxx_tim4_sr.clear_cc1if = STM32FXXXTim4_clear_cc1if;
	stm32fxxx_tim4_sr.uif = STM32FXXXTim4_uif;
	stm32fxxx_tim4_sr.clear_uif = STM32FXXXTim4_clear_uif;
	return &stm32fxxx_tim4_sr;
}
STM32FXXXTIM4_EGR* stm32fxxx_tim4_egr_inic(void)
{

	// EGR
	stm32fxxx_tim4_egr.tg = STM32FXXXTim4_tg;
	stm32fxxx_tim4_egr.cc4g = STM32FXXXTim4_cc4g;
	stm32fxxx_tim4_egr.cc3g = STM32FXXXTim4_cc3g;
	stm32fxxx_tim4_egr.cc2g = STM32FXXXTim4_cc2g;
	stm32fxxx_tim4_egr.cc1g = STM32FXXXTim4_cc1g;
	stm32fxxx_tim4_egr.ug = STM32FXXXTim4_ug;
	return &stm32fxxx_tim4_egr;
}
STM32FXXXTIM4_CCMR1* stm32fxxx_tim4_ccmr1_inic(void)
{

	// CCMR1
	stm32fxxx_tim4_ccmr1.oc2ce = STM32FXXXTim4_oc2ce;
	stm32fxxx_tim4_ccmr1.oc2m = STM32FXXXTim4_oc2m;
	stm32fxxx_tim4_ccmr1.ic2f = STM32FXXXTim4_ic2f;
	stm32fxxx_tim4_ccmr1.oc2pe = STM32FXXXTim4_oc2pe;
	stm32fxxx_tim4_ccmr1.oc2fe = STM32FXXXTim4_oc2fe;
	stm32fxxx_tim4_ccmr1.ic2psc = STM32FXXXTim4_ic2psc;
	stm32fxxx_tim4_ccmr1.cc2s = STM32FXXXTim4_cc2s;
	stm32fxxx_tim4_ccmr1.oc1ce = STM32FXXXTim4_oc1ce;
	stm32fxxx_tim4_ccmr1.oc1m = STM32FXXXTim4_oc1m;
	stm32fxxx_tim4_ccmr1.ic1f = STM32FXXXTim4_ic1f;
	stm32fxxx_tim4_ccmr1.oc1pe = STM32FXXXTim4_oc1pe;
	stm32fxxx_tim4_ccmr1.oc1fe = STM32FXXXTim4_oc1fe;
	stm32fxxx_tim4_ccmr1.ic1psc = STM32FXXXTim4_ic1psc;
	stm32fxxx_tim4_ccmr1.cc1s = STM32FXXXTim4_cc1s;
	return &stm32fxxx_tim4_ccmr1;
}
STM32FXXXTIM4_CCMR2* stm32fxxx_tim4_ccmr2_inic(void)
{

	// CCMR2
	stm32fxxx_tim4_ccmr2.oc4ce = STM32FXXXTim4_oc4ce;
	stm32fxxx_tim4_ccmr2.oc4m = STM32FXXXTim4_oc4m;
	stm32fxxx_tim4_ccmr2.ic4f = STM32FXXXTim4_ic4f;
	stm32fxxx_tim4_ccmr2.oc4pe = STM32FXXXTim4_oc4pe;
	stm32fxxx_tim4_ccmr2.oc4fe = STM32FXXXTim4_oc4fe;
	stm32fxxx_tim4_ccmr2.ic4psc = STM32FXXXTim4_ic4psc;
	stm32fxxx_tim4_ccmr2.cc4s = STM32FXXXTim4_cc4s;
	stm32fxxx_tim4_ccmr2.oc3ce = STM32FXXXTim4_oc3ce;
	stm32fxxx_tim4_ccmr2.oc3m = STM32FXXXTim4_oc3m;
	stm32fxxx_tim4_ccmr2.ic3f = STM32FXXXTim4_ic3f;
	stm32fxxx_tim4_ccmr2.oc3pe = STM32FXXXTim4_oc3pe;
	stm32fxxx_tim4_ccmr2.oc3fe = STM32FXXXTim4_oc3fe;
	stm32fxxx_tim4_ccmr2.ic3psc = STM32FXXXTim4_ic3psc;
	stm32fxxx_tim4_ccmr2.cc3s = STM32FXXXTim4_cc3s;
	return &stm32fxxx_tim4_ccmr2;
}
STM32FXXXTIM4_CCER* stm32fxxx_tim4_ccer_inic(void)
{

	// CCER
	stm32fxxx_tim4_ccer.cc4np = STM32FXXXTim4_cc4np;
	stm32fxxx_tim4_ccer.cc4p = STM32FXXXTim4_cc4p;
	stm32fxxx_tim4_ccer.cc4e = STM32FXXXTim4_cc4e;
	stm32fxxx_tim4_ccer.cc3np = STM32FXXXTim4_cc3np;
	stm32fxxx_tim4_ccer.cc3p = STM32FXXXTim4_cc3p;
	stm32fxxx_tim4_ccer.cc3e = STM32FXXXTim4_cc3e;
	stm32fxxx_tim4_ccer.cc2np = STM32FXXXTim4_cc2np;
	stm32fxxx_tim4_ccer.cc2p = STM32FXXXTim4_cc2p;
	stm32fxxx_tim4_ccer.cc2e = STM32FXXXTim4_cc2e;
	stm32fxxx_tim4_ccer.cc1np = STM32FXXXTim4_cc1np;
	stm32fxxx_tim4_ccer.cc1p = STM32FXXXTim4_cc1p;
	stm32fxxx_tim4_ccer.cc1e = STM32FXXXTim4_cc1e;
	return &stm32fxxx_tim4_ccer;
}
STM32FXXXTIM4_DCR* stm32fxxx_tim4_dcr_inic(void)
{

	// CCER
	stm32fxxx_tim4_dcr.dbl = STM32FXXXTim4_dbl;
	stm32fxxx_tim4_dcr.dba = STM32FXXXTim4_dba;
	return &stm32fxxx_tim4_dcr;
}
/*** TIM4 INIC Procedure & Function Definition ***/
STM32FXXXTIM4obj tim4_enable(void)
{


	// CLOCK
	stm32fxxx_tim4.clock = STM32FXXXTim4Clock;
	// NVIC
	stm32fxxx_tim4.nvic = STM32FXXXTim4Nvic;
	/*** TIM4 Bit Mapping Link ***/
	stm32fxxx_tim4.cr1 = stm32fxxx_tim4_cr1_inic();
	stm32fxxx_tim4.cr2 = stm32fxxx_tim4_cr2_inic();
	stm32fxxx_tim4.smcr = stm32fxxx_tim4_smcr_inic();
	stm32fxxx_tim4.dier = stm32fxxx_tim4_dier_inic();
	stm32fxxx_tim4.sr = stm32fxxx_tim4_sr_inic();
	stm32fxxx_tim4.egr = stm32fxxx_tim4_egr_inic();
	stm32fxxx_tim4.ccmr1 = stm32fxxx_tim4_ccmr1_inic();
	stm32fxxx_tim4.ccmr2 = stm32fxxx_tim4_ccmr2_inic();
	stm32fxxx_tim4.ccer = stm32fxxx_tim4_ccer_inic();
	stm32fxxx_tim4.dcr = stm32fxxx_tim4_dcr_inic();
	stm32fxxx_tim4.cnt = STM32FXXXTim4_cnt;
	stm32fxxx_tim4.get_cnt = STM32FXXXTim4_get_cnt;
	stm32fxxx_tim4.psc = STM32FXXXTim4_psc;
	stm32fxxx_tim4.arr = STM32FXXXTim4_arr;
	stm32fxxx_tim4.ccr1 = STM32FXXXTim4_ccr1;
	stm32fxxx_tim4.ccr2 = STM32FXXXTim4_ccr2;
	stm32fxxx_tim4.ccr3 = STM32FXXXTim4_ccr3;
	stm32fxxx_tim4.ccr4 = STM32FXXXTim4_ccr4;
	stm32fxxx_tim4.dmar = STM32FXXXTim4_dmab;
	return stm32fxxx_tim4;
}

STM32FXXXTIM4obj* tim4(void){ return (STM32FXXXTIM4obj*) &stm32fxxx_tim4; }

/*** TIM5 Auxiliar ***/
STM32FXXXTIM5_CR1* stm32fxxx_tim5_cr1_inic(void)
{

	// CR1
	stm32fxxx_tim5_cr1.get_ckd = STM32FXXXTim5_get_ckd;
	stm32fxxx_tim5_cr1.apre = STM32FXXXTim5_set_apre;
	stm32fxxx_tim5_cr1.cms = STM32FXXXTim5_set_cms;
	stm32fxxx_tim5_cr1.dir = STM32FXXXTim5_set_dir;
	stm32fxxx_tim5_cr1.opm = STM32FXXXTim5_set_opm;
	stm32fxxx_tim5_cr1.urs = STM32FXXXTim5_set_urs;
	stm32fxxx_tim5_cr1.udis = STM32FXXXTim5_set_udis;
	stm32fxxx_tim5_cr1.cen = STM32FXXXTim5_cen;
	return &stm32fxxx_tim5_cr1;
}
STM32FXXXTIM5_CR2* stm32fxxx_tim5_cr2_inic(void)
{

