BitNibble/Source_Library/stm32f411lib/src/stm32fxxxtim2to5.c
	// CR2
	stm32fxxx_tim5_cr2.ti1s = STM32FXXXTim5_ti1s;
	stm32fxxx_tim5_cr2.mms = STM32FXXXTim5_mms;
	stm32fxxx_tim5_cr2.ccds = STM32FXXXTim5_ccds;
	return &stm32fxxx_tim5_cr2;
}
STM32FXXXTIM5_SMCR* stm32fxxx_tim5_smcr_inic(void)
{

	// SMCR
	stm32fxxx_tim5_smcr.etp = STM32FXXXTim5_etp;
	stm32fxxx_tim5_smcr.ece = STM32FXXXTim5_ece;
	stm32fxxx_tim5_smcr.etps = STM32FXXXTim5_etps;
	stm32fxxx_tim5_smcr.etf = STM32FXXXTim5_etf;
	stm32fxxx_tim5_smcr.msm = STM32FXXXTim5_msm;
	stm32fxxx_tim5_smcr.ts = STM32FXXXTim5_ts;
	stm32fxxx_tim5_smcr.sms = STM32FXXXTim5_sms;
	return &stm32fxxx_tim5_smcr;
}
STM32FXXXTIM5_DIER* stm32fxxx_tim5_dier_inic(void)
{

	// DIER
	stm32fxxx_tim5_dier.tde = STM32FXXXTim5_tde;
	stm32fxxx_tim5_dier.cc4de = STM32FXXXTim5_cc4de;
	stm32fxxx_tim5_dier.cc3de = STM32FXXXTim5_cc3de;
	stm32fxxx_tim5_dier.cc2de = STM32FXXXTim5_cc2de;
	stm32fxxx_tim5_dier.cc1de = STM32FXXXTim5_cc1de;
	stm32fxxx_tim5_dier.ude = STM32FXXXTim5_ude;
	stm32fxxx_tim5_dier.tie = STM32FXXXTim5_tie;
	stm32fxxx_tim5_dier.cc4ie = STM32FXXXTim5_cc4ie;
	stm32fxxx_tim5_dier.cc3ie = STM32FXXXTim5_cc3ie;
	stm32fxxx_tim5_dier.cc2ie = STM32FXXXTim5_cc2ie;
	stm32fxxx_tim5_dier.cc1ie = STM32FXXXTim5_cc1ie;
	stm32fxxx_tim5_dier.uie = STM32FXXXTim5_uie;
	return &stm32fxxx_tim5_dier;
}
STM32FXXXTIM5_SR* stm32fxxx_tim5_sr_inic(void)
{

	// SR
	stm32fxxx_tim5_sr.cc4of = STM32FXXXTim5_cc4of;
	stm32fxxx_tim5_sr.clear_cc4of = STM32FXXXTim5_clear_cc4of;
	stm32fxxx_tim5_sr.cc3of = STM32FXXXTim5_cc3of;
	stm32fxxx_tim5_sr.clear_cc3of = STM32FXXXTim5_clear_cc3of;
	stm32fxxx_tim5_sr.cc2of = STM32FXXXTim5_cc2of;
	stm32fxxx_tim5_sr.clear_cc2of = STM32FXXXTim5_clear_cc2of;
	stm32fxxx_tim5_sr.cc1of = STM32FXXXTim5_cc1of;
	stm32fxxx_tim5_sr.clear_cc1of = STM32FXXXTim5_clear_cc1of;
	stm32fxxx_tim5_sr.tif = STM32FXXXTim5_tif;
	stm32fxxx_tim5_sr.clear_tif = STM32FXXXTim5_clear_tif;
	stm32fxxx_tim5_sr.cc4if = STM32FXXXTim5_cc4if;
	stm32fxxx_tim5_sr.clear_cc4if = STM32FXXXTim5_clear_cc4if;
	stm32fxxx_tim5_sr.cc3if = STM32FXXXTim5_cc3if;
	stm32fxxx_tim5_sr.clear_cc3if = STM32FXXXTim5_clear_cc3if;
	stm32fxxx_tim5_sr.cc2if = STM32FXXXTim5_cc2if;
	stm32fxxx_tim5_sr.clear_cc2if = STM32FXXXTim5_clear_cc2if;
	stm32fxxx_tim5_sr.cc1if = STM32FXXXTim5_cc1if;
	stm32fxxx_tim5_sr.clear_cc1if = STM32FXXXTim5_clear_cc1if;
	stm32fxxx_tim5_sr.uif = STM32FXXXTim5_uif;
	stm32fxxx_tim5_sr.clear_uif = STM32FXXXTim5_clear_uif;
	return &stm32fxxx_tim5_sr;
}
STM32FXXXTIM5_EGR* stm32fxxx_tim5_egr_inic(void)
{

	// EGR
	stm32fxxx_tim5_egr.tg = STM32FXXXTim5_tg;
	stm32fxxx_tim5_egr.cc4g = STM32FXXXTim5_cc4g;
	stm32fxxx_tim5_egr.cc3g = STM32FXXXTim5_cc3g;
	stm32fxxx_tim5_egr.cc2g = STM32FXXXTim5_cc2g;
	stm32fxxx_tim5_egr.cc1g = STM32FXXXTim5_cc1g;
	stm32fxxx_tim5_egr.ug = STM32FXXXTim5_ug;
	return &stm32fxxx_tim5_egr;
}
STM32FXXXTIM5_CCMR1* stm32fxxx_tim5_ccmr1_inic(void)
{

	// CCMR1
	stm32fxxx_tim5_ccmr1.oc2ce = STM32FXXXTim5_oc2ce;
	stm32fxxx_tim5_ccmr1.oc2m = STM32FXXXTim5_oc2m;
	stm32fxxx_tim5_ccmr1.ic2f = STM32FXXXTim5_ic2f;
	stm32fxxx_tim5_ccmr1.oc2pe = STM32FXXXTim5_oc2pe;
	stm32fxxx_tim5_ccmr1.oc2fe = STM32FXXXTim5_oc2fe;
	stm32fxxx_tim5_ccmr1.ic2psc = STM32FXXXTim5_ic2psc;
	stm32fxxx_tim5_ccmr1.cc2s = STM32FXXXTim5_cc2s;
	stm32fxxx_tim5_ccmr1.oc1ce = STM32FXXXTim5_oc1ce;
	stm32fxxx_tim5_ccmr1.oc1m = STM32FXXXTim5_oc1m;
	stm32fxxx_tim5_ccmr1.ic1f = STM32FXXXTim5_ic1f;
	stm32fxxx_tim5_ccmr1.oc1pe = STM32FXXXTim5_oc1pe;
	stm32fxxx_tim5_ccmr1.oc1fe = STM32FXXXTim5_oc1fe;
	stm32fxxx_tim5_ccmr1.ic1psc = STM32FXXXTim5_ic1psc;
	stm32fxxx_tim5_ccmr1.cc1s = STM32FXXXTim5_cc1s;
	return &stm32fxxx_tim5_ccmr1;
}
STM32FXXXTIM5_CCMR2* stm32fxxx_tim5_ccmr2_inic(void)
{

	// CCMR2
	stm32fxxx_tim5_ccmr2.oc4ce = STM32FXXXTim5_oc4ce;
	stm32fxxx_tim5_ccmr2.oc4m = STM32FXXXTim5_oc4m;
	stm32fxxx_tim5_ccmr2.ic4f = STM32FXXXTim5_ic4f;
	stm32fxxx_tim5_ccmr2.oc4pe = STM32FXXXTim5_oc4pe;
	stm32fxxx_tim5_ccmr2.oc4fe = STM32FXXXTim5_oc4fe;
	stm32fxxx_tim5_ccmr2.ic4psc = STM32FXXXTim5_ic4psc;
	stm32fxxx_tim5_ccmr2.cc4s = STM32FXXXTim5_cc4s;
	stm32fxxx_tim5_ccmr2.oc3ce = STM32FXXXTim5_oc3ce;
	stm32fxxx_tim5_ccmr2.oc3m = STM32FXXXTim5_oc3m;
	stm32fxxx_tim5_ccmr2.ic3f = STM32FXXXTim5_ic3f;
	stm32fxxx_tim5_ccmr2.oc3pe = STM32FXXXTim5_oc3pe;
	stm32fxxx_tim5_ccmr2.oc3fe = STM32FXXXTim5_oc3fe;
	stm32fxxx_tim5_ccmr2.ic3psc = STM32FXXXTim5_ic3psc;
	stm32fxxx_tim5_ccmr2.cc3s = STM32FXXXTim5_cc3s;
	return &stm32fxxx_tim5_ccmr2;
}
STM32FXXXTIM5_CCER* stm32fxxx_tim5_ccer_inic(void)
{

	// CCER
	stm32fxxx_tim5_ccer.cc4np = STM32FXXXTim5_cc4np;
	stm32fxxx_tim5_ccer.cc4p = STM32FXXXTim5_cc4p;
	stm32fxxx_tim5_ccer.cc4e = STM32FXXXTim5_cc4e;
	stm32fxxx_tim5_ccer.cc3np = STM32FXXXTim5_cc3np;
	stm32fxxx_tim5_ccer.cc3p = STM32FXXXTim5_cc3p;
	stm32fxxx_tim5_ccer.cc3e = STM32FXXXTim5_cc3e;
	stm32fxxx_tim5_ccer.cc2np = STM32FXXXTim5_cc2np;
	stm32fxxx_tim5_ccer.cc2p = STM32FXXXTim5_cc2p;
	stm32fxxx_tim5_ccer.cc2e = STM32FXXXTim5_cc2e;
	stm32fxxx_tim5_ccer.cc1np = STM32FXXXTim5_cc1np;
	stm32fxxx_tim5_ccer.cc1p = STM32FXXXTim5_cc1p;
	stm32fxxx_tim5_ccer.cc1e = STM32FXXXTim5_cc1e;
	return &stm32fxxx_tim5_ccer;
}
STM32FXXXTIM5_DCR* stm32fxxx_tim5_dcr_inic(void)
{

	// CCER
	stm32fxxx_tim5_dcr.dbl = STM32FXXXTim5_dbl;
	stm32fxxx_tim5_dcr.dba = STM32FXXXTim5_dba;
	return &stm32fxxx_tim5_dcr;
}
/*** TIM5 INIC Procedure & Function Definition ***/
STM32FXXXTIM5obj tim5_enable(void)
{


	// CLOCK
	stm32fxxx_tim5.clock = STM32FXXXTim5Clock;
	// NVIC
	stm32fxxx_tim5.nvic = STM32FXXXTim5Nvic;
	/*** TIM5 Bit Mapping Link ***/
	stm32fxxx_tim5.cr1 = stm32fxxx_tim5_cr1_inic();
	stm32fxxx_tim5.cr2 = stm32fxxx_tim5_cr2_inic();
	stm32fxxx_tim5.smcr = stm32fxxx_tim5_smcr_inic();
	stm32fxxx_tim5.dier = stm32fxxx_tim5_dier_inic();
	stm32fxxx_tim5.sr = stm32fxxx_tim5_sr_inic();
	stm32fxxx_tim5.egr = stm32fxxx_tim5_egr_inic();
	stm32fxxx_tim5.ccmr1 = stm32fxxx_tim5_ccmr1_inic();
	stm32fxxx_tim5.ccmr2 = stm32fxxx_tim5_ccmr2_inic();
	stm32fxxx_tim5.ccer = stm32fxxx_tim5_ccer_inic();
	stm32fxxx_tim5.dcr = stm32fxxx_tim5_dcr_inic();
	stm32fxxx_tim5.cnt = STM32FXXXTim5_cnt;
	stm32fxxx_tim5.get_cnt = STM32FXXXTim5_get_cnt;
	stm32fxxx_tim5.psc = STM32FXXXTim5_psc;
	stm32fxxx_tim5.arr = STM32FXXXTim5_arr;
	stm32fxxx_tim5.ccr1 = STM32FXXXTim5_ccr1;
	stm32fxxx_tim5.ccr2 = STM32FXXXTim5_ccr2;
	stm32fxxx_tim5.ccr3 = STM32FXXXTim5_ccr3;
	stm32fxxx_tim5.ccr4 = STM32FXXXTim5_ccr4;
	stm32fxxx_tim5.dmar = STM32FXXXTim5_dmab;
	stm32fxxx_tim5.or = STM32FXXXTim5_ti4_rmp;
	return stm32fxxx_tim5;
}

STM32FXXXTIM5obj* tim5(void){ return (STM32FXXXTIM5obj*) &stm32fxxx_tim5; }

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/

